Revit 2027 API
Application.NewViewSet Method
Creates a new instance of a View set.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewSet NewViewSet()
Public Function NewViewSet As ViewSet
public:
ViewSet^ NewViewSet()
member NewViewSet : unit -> ViewSet
Return Value
ViewSet
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace